//Используя Visual Studio, создайте проект по шаблону Console Application
//Требуется: Создать класс Invoice.
//В теле класса создать три поля int account, string customer, string provider,
//которые должны быть проинициализированы один раз (при создании экземпляра данного класса) без возможности их дальнейшего изменения.
//В теле класса создать два закрытых поля string article, int quantity
//Создать метод расчета стоимости заказа с НДС и без НДС.
//Написать программу, которая выводит на экран сумму оплаты заказанного товара с НДС или без НДС.

namespace TeachMeSkills.DotNet.Task7
{
    enum Iphone
    {
        Unknown = 0,
        X7 = 300,
        X8 = 400,
        X10 = 600,
        X11 = 700,
        X12 = 800,
    }
}
